# handlers/location.py

distances_km = {
    "Тошкент": {
        "Андижон": 338,
        "Бухоро": 592,
        "Жиззах": 200,
        "Қашқадарё": 460,
        "Навоий": 440,
        "Наманган": 291,
        "Нукус": 1055,
        "Самарқанд": 305,
        "Сирдарё": 125,
        "Сурхондарё": 590,
        "Фарғона": 320,
        "Хоразм": 980,
        "Тошкент": 0
    },
    "Андижон": {
        "Тошкент": 338,
        "Наманган": 70,
        "Фарғона": 60,
        "Жиззах": 430,
        "Самарқанд": 530,
        "Сирдарё": 400,
        "Андижон": 0
    },
    "Наманган": {
        "Тошкент": 291,
        "Андижон": 70,
        "Фарғона": 110,
        "Жиззах": 380,
        "Самарқанд": 480,
        "Сирдарё": 350,
        "Наманган": 0
    },
    "Фарғона": {
        "Тошкент": 320,
        "Наманган": 110,
        "Андижон": 60,
        "Жиззах": 410,
        "Самарқанд": 510,
        "Сирдарё": 380,
        "Фарғона": 0
    },
    "Жиззах": {
        "Тошкент": 200,
        "Самарқанд": 90,
        "Сирдарё": 80,
        "Навоий": 260,
        "Жиззах": 0
    },
    "Самарқанд": {
        "Тошкент": 305,
        "Жиззах": 90,
        "Сирдарё": 160,
        "Навоий": 180,
        "Қашқадарё": 190,
        "Самарқанд": 0
    },
    "Сирдарё": {
        "Тошкент": 125,
        "Жиззах": 80,
        "Самарқанд": 160,
        "Сирдарё": 0
    },
    "Қашқадарё": {
        "Самарқанд": 190,
        "Сурхондарё": 150,
        "Бухоро": 310,
        "Қашқадарё": 0
    },
    "Сурхондарё": {
        "Қашқадарё": 150,
        "Бухоро": 470,
        "Сурхондарё": 0
    },
    "Бухоро": {
        "Тошкент": 592,
        "Навоий": 100,
        "Қашқадарё": 310,
        "Сурхондарё": 470,
        "Хоразм": 430,
        "Бухоро": 0
    },
    "Навоий": {
        "Тошкент": 440,
        "Самарқанд": 180,
        "Жиззах": 260,
        "Бухоро": 100,
        "Хоразм": 370,
        "Нукус": 460,
        "Навоий": 0
    },
    "Хоразм": {
        "Бухоро": 430,
        "Навоий": 370,
        "Нукус": 230,
        "Хоразм": 0
    },
    "Нукус": {
        "Навоий": 460,
        "Хоразм": 230,
        "Тошкент": 1055,
        "Нукус": 0
    }
}
price = distances_km["Тошкент"]["Самарқанд"] * 500

distance_data = {
    "Тошкент": {
        "Андижон": 345,
        "Бухоро": 580,
        "Жиззах": 200,
        "Қашқадарё": 460,
        "Навоий": 520,
        "Наманган": 290,
        "Нукус": 1090,
        "Самарқанд": 310,
        "Сирдарё": 120,
        "Сурхондарё": 600,
        "Фарғона": 320,
        "Хоразм": 1000,
        "Тошкент": 0
    },
    "Андижон": {
        "Тошкент": 345,
        "Бухоро": 830,
        "Жиззах": 440,
        "Қашқадарё": 610,
        "Навоий": 770,
        "Наманган": 50,
        "Нукус": 1290,
        "Самарқанд": 550,
        "Сирдарё": 350,
        "Сурхондарё": 760,
        "Фарғона": 60,
        "Хоразм": 1200,
        "Андижон": 0
    },
    "Бухоро": {
        "Тошкент": 580,
        "Андижон": 830,
        "Жиззах": 390,
        "Қашқадарё": 220,
        "Навоий": 100,
        "Наманган": 780,
        "Нукус": 470,
        "Самарқанд": 270,
        "Сирдарё": 460,
        "Сурхондарё": 350,
        "Фарғона": 820,
        "Хоразм": 450,
        "Бухоро": 0
    },
    "Жиззах": {
        "Тошкент": 200,
        "Андижон": 440,
        "Бухоро": 390,
        "Қашқадарё": 320,
        "Навоий": 350,
        "Наманган": 400,
        "Нукус": 860,
        "Самарқанд": 100,
        "Сирдарё": 100,
        "Сурхондарё": 450,
        "Фарғона": 420,
        "Хоразм": 880,
        "Жиззах": 0
    },
    "Қашқадарё": {
        "Тошкент": 460,
        "Андижон": 610,
        "Бухоро": 220,
        "Жиззах": 320,
        "Навоий": 290,
        "Наманган": 570,
        "Нукус": 690,
        "Самарқанд": 190,
        "Сирдарё": 360,
        "Сурхондарё": 180,
        "Фарғона": 600,
        "Хоразм": 640,
        "Қашқадарё": 0
    },
    "Навоий": {
        "Тошкент": 520,
        "Андижон": 770,
        "Бухоро": 100,
        "Жиззах": 350,
        "Қашқадарё": 290,
        "Наманган": 720,
        "Нукус": 570,
        "Самарқанд": 220,
        "Сирдарё": 410,
        "Сурхондарё": 370,
        "Фарғона": 760,
        "Хоразм": 560,
        "Навоий": 0
    },
    "Наманган": {
        "Тошкент": 290,
        "Андижон": 50,
        "Бухоро": 780,
        "Жиззах": 400,
        "Қашқадарё": 570,
        "Навоий": 720,
        "Нукус": 1240,
        "Самарқанд": 500,
        "Сирдарё": 310,
        "Сурхондарё": 720,
        "Фарғона": 90,
        "Хоразм": 1150,
        "Наманган": 0
    },
    "Нукус": {
        "Тошкент": 1090,
        "Андижон": 1290,
        "Бухоро": 470,
        "Жиззах": 860,
        "Қашқадарё": 690,
        "Навоий": 570,
        "Наманган": 1240,
        "Самарқанд": 770,
        "Сирдарё": 970,
        "Сурхондарё": 800,
        "Фарғона": 1270,
        "Хоразм": 80,
        "Нукус": 0
    },
    "Самарқанд": {
        "Тошкент": 310,
        "Андижон": 550,
        "Бухоро": 270,
        "Жиззах": 100,
        "Қашқадарё": 190,
        "Навоий": 220,
        "Наманган": 500,
        "Нукус": 770,
        "Сирдарё": 210,
        "Сурхондарё": 330,
        "Фарғона": 530,
        "Хоразм": 780,
        "Самарқанд": 0
    },
    "Сирдарё": {
        "Тошкент": 120,
        "Андижон": 350,
        "Бухоро": 460,
        "Жиззах": 100,
        "Қашқадарё": 360,
        "Навоий": 410,
        "Наманган": 310,
        "Нукус": 970,
        "Самарқанд": 210,
        "Сурхондарё": 480,
        "Фарғона": 370,
        "Хоразм": 940,
        "Сирдарё": 0
    },
    "Сурхондарё": {
        "Тошкент": 600,
        "Андижон": 760,
        "Бухоро": 350,
        "Жиззах": 450,
        "Қашқадарё": 180,
        "Навоий": 370,
        "Наманган": 720,
        "Нукус": 800,
        "Самарқанд": 330,
        "Сирдарё": 480,
        "Фарғона": 750,
        "Хоразм": 750,
        "Сурхондарё": 0
    },
    "Фарғона": {
        "Тошкент": 320,
        "Андижон": 60,
        "Бухоро": 820,
        "Жиззах": 420,
        "Қашқадарё": 600,
        "Навоий": 760,
        "Наманган": 90,
        "Нукус": 1270,
        "Самарқанд": 530,
        "Сирдарё": 370,
        "Сурхондарё": 750,
        "Хоразм": 1180,
        "Фарғона": 0
    },
    "Хоразм": {
        "Тошкент": 1000,
        "Андижон": 1200,
        "Бухоро": 450,
        "Жиззах": 880,
        "Қашқадарё": 640,
        "Навоий": 560,
        "Наманган": 1150,
        "Нукус": 80,
        "Самарқанд": 780,
        "Сирдарё": 940,
        "Сурхондарё": 750,
        "Фарғона": 1180,
        "Хоразм": 0
    }
}
masofa = distance_data["Тошкент"]["Наманган"]  # 290

uzbekistan_distances = {
    "Тошкент ш.": {
        "Тошкент в.": 40,
        "Андижон": 340,
        "Наманган": 292,
        "Фарғона": 320,
        "Сирдарё": 120,
        "Жиззах": 200,
        "Самарқанд": 310,
        "Навоий": 440,
        "Бухоро": 580,
        "Қашқадарё": 510,
        "Сурхондарё": 660,
        "Хоразм": 1050,
        "Қорақалпоғистон": 1150,
    },
    "Тошкент в.": {
        "Тошкент ш.": 40,
        "Андижон": 330,
        "Наманган": 280,
        "Фарғона": 310,
        "Сирдарё": 110,
        "Жиззах": 190,
        "Самарқанд": 300,
        "Навоий": 430,
        "Бухоро": 570,
        "Қашқадарё": 500,
        "Сурхондарё": 650,
        "Хоразм": 1040,
        "Қорақалпоғистон": 1140,
    },
    "Андижон": {
        "Наманган": 70,
        "Фарғона": 90,
        "Тошкент ш.": 340,
        "Тошкент в.": 330,
        "Сирдарё": 450,
        "Жиззах": 530,
        "Самарқанд": 640,
        "Навоий": 770,
        "Бухоро": 910,
        "Қашқадарё": 840,
        "Сурхондарё": 990,
        "Хоразм": 1390,
        "Қорақалпоғистон": 1490,
    },
    "Наманган": {
        "Фарғона": 70,
        "Андижон": 70,
        "Тошкент ш.": 292,
        "Тошкент в.": 280,
        "Сирдарё": 400,
        "Жиззах": 480,
        "Самарқанд": 590,
        "Навоий": 720,
        "Бухоро": 860,
        "Қашқадарё": 790,
        "Сурхондарё": 940,
        "Хоразм": 1340,
        "Қорақалпоғистон": 1440,
    },
    "Фарғона": {
        "Наманган": 70,
        "Андижон": 90,
        "Тошкент ш.": 320,
        "Тошкент в.": 310,
        "Сирдарё": 430,
        "Жиззах": 510,
        "Самарқанд": 620,
        "Навоий": 750,
        "Бухоро": 890,
        "Қашқадарё": 820,
        "Сурхондарё": 970,
        "Хоразм": 1370,
        "Қорақалпоғистон": 1470,
    },
    "Сирдарё": {
        "Тошкент ш.": 120,
        "Тошкент в.": 110,
        "Жиззах": 90,
        "Самарқанд": 210,
        "Навоий": 340,
        "Бухоро": 480,
        "Қашқадарё": 410,
        "Сурхондарё": 560,
        "Хоразм": 960,
        "Қорақалпоғистон": 1060,
    },
    "Жиззах": {
        "Тошкент ш.": 200,
        "Тошкент в.": 190,
        "Сирдарё": 90,
        "Самарқанд": 120,
        "Навоий": 250,
        "Бухоро": 390,
        "Қашқадарё": 320,
        "Сурхондарё": 470,
        "Хоразм": 870,
        "Қорақалпоғистон": 970,
    },
    "Самарқанд": {
        "Жиззах": 120,
        "Сирдарё": 210,
        "Навоий": 130,
        "Бухоро": 270,
        "Қашқадарё": 200,
        "Сурхондарё": 350,
        "Тошкент ш.": 310,
        "Тошкент в.": 300,
        "Хоразм": 750,
        "Қорақалпоғистон": 850,
    },
    "Навоий": {
        "Самарқанд": 130,
        "Жиззах": 250,
        "Сирдарё": 340,
        "Бухоро": 140,
        "Қашқадарё": 330,
        "Сурхондарё": 480,
        "Хоразм": 620,
        "Қорақалпоғистон": 720,
        "Тошкент ш.": 440,
        "Тошкент в.": 430,
    },
    "Бухоро": {
        "Навоий": 140,
        "Андижон": 910,
        "Самарқанд": 270,
        "Қашқадарё": 290,
        "Сурхондарё": 440,
        "Хоразм": 500,
        "Қорақалпоғистон": 600,
        "Тошкент ш.": 580,
        "Тошкент в.": 570,
    },
    "Қашқадарё": {
        "Самарқанд": 200,
        "Навоий": 330,
        "Бухоро": 290,
        "Сурхондарё": 150,
        "Хоразм": 650,
        "Қорақалпоғистон": 750,
        "Тошкент ш.": 510,
        "Тошкент в.": 500,
    },
    "Сурхондарё": {
        "Қашқадарё": 150,
        "Самарқанд": 350,
        "Навоий": 480,
        "Бухоро": 440,
        "Хоразм": 700,
        "Қорақалпоғистон": 800,
        "Тошкент ш.": 660,
        "Тошкент в.": 650,
    },
    "Хоразм": {
        "Қорақалпоғистон": 130,
        "Сурхондарё": 700,
        "Қашқадарё": 650,
        "Бухоро": 500,
        "Навоий": 620,
        "Самарқанд": 750,
        "Тошкент ш.": 1050,
        "Тошкент в.": 1040,
    },
    "Қорақалпоғистон": {
        "Хоразм": 130,
        "Сурхондарё": 800,
        "Қашқадарё": 750,
        "Бухоро": 600,
        "Навоий": 720,
        "Самарқанд": 850,
        "Тошкент ш.": 1150,
        "Тошкент в.": 1140,
    }
}

region_to_tashkent_district_distances = {
    "Андижон": {
        "Миробод": 330,
        "Юнусобод": 335,
        "Чилонзор": 325,
        "Шайхонтохур": 328,
        "Олмазор": 327,
        "Учтепа": 326,
        "Бектемир": 320,
        "Сергели": 322,
        "Мирзо Улуғбек": 331,
        "Янгихаёт": 330,
        "Яшнобод": 332,
    },
    "Наманган": {
        "Миробод": 290,
        "Юнусобод": 295,
        "Чилонзор": 285,
        "Шайхонтохур": 288,
        "Олмазор": 287,
        "Учтепа": 286,
        "Бектемир": 280,
        "Сергели": 282,
        "Мирзо Улуғбек": 291,
        "Янгихаёт": 290,
        "Яшнобод": 292,
    },
    "Фарғона": {
        "Миробод": 310,
        "Юнусобод": 315,
        "Чилонзор": 305,
        "Шайхонтохур": 308,
        "Олмазор": 307,
        "Учтепа": 306,
        "Бектемир": 300,
        "Сергели": 302,
        "Мирзо Улуғбек": 311,
        "Янгихаёт": 310,
        "Яшнобод": 312,
    },
    "Самарқанд": {
        "Миробод": 310,
        "Юнусобод": 315,
        "Чилонзор": 305,
        "Шайхонтохур": 308,
        "Олмазор": 307,
        "Учтепа": 306,
        "Бектемир": 300,
        "Сергели": 302,
        "Мирзо Улуғбек": 311,
        "Янгихаёт": 310,
        "Яшнобод": 312,
    },
    "Бухоро": {
        "Миробод": 580,
        "Юнусобод": 585,
        "Чилонзор": 575,
        "Шайхонтохур": 578,
        "Олмазор": 577,
        "Учтепа": 576,
        "Бектемир": 570,
        "Сергели": 572,
        "Мирзо Улуғбек": 581,
        "Янгихаёт": 580,
        "Яшнобод": 582,
    },
    "Хоразм": {
        "Миробод": 1050,
        "Юнусобод": 1055,
        "Чилонзор": 1045,
        "Шайхонтохур": 1048,
        "Олмазор": 1047,
        "Учтепа": 1046,
        "Бектемир": 1040,
        "Сергели": 1042,
        "Мирзо Улуғбек": 1051,
        "Янгихаёт": 1050,
        "Яшнобод": 1052,
    },
    "Қашқадарё": {
        "Миробод": 460,
        "Юнусобод": 465,
        "Чилонзор": 455,
        "Шайхонтохур": 458,
        "Олмазор": 457,
        "Учтепа": 456,
        "Бектемир": 450,
        "Сергели": 452,
        "Мирзо Улуғбек": 461,
        "Янгихаёт": 460,
        "Яшнобод": 462,
    },
    "Сурхондарё": {
        "Миробод": 660,
        "Юнусобод": 665,
        "Чилонзор": 655,
        "Шайхонтохур": 658,
        "Олмазор": 657,
        "Учтепа": 656,
        "Бектемир": 650,
        "Сергели": 652,
        "Мирзо Улуғбек": 661,
        "Янгихаёт": 660,
        "Яшнобод": 662,
    },
    "Навоий": {
        "Миробод": 500,
        "Юнусобод": 505,
        "Чилонзор": 495,
        "Шайхонтохур": 498,
        "Олмазор": 497,
        "Учтепа": 496,
        "Бектемир": 490,
        "Сергели": 492,
        "Мирзо Улуғбек": 501,
        "Янгихаёт": 500,
        "Яшнобод": 502,
    },
    "Сирдарё": {
        "Миробод": 130,
        "Юнусобод": 135,
        "Чилонзор": 125,
        "Шайхонтохур": 128,
        "Олмазор": 127,
        "Учтепа": 126,
        "Бектемир": 120,
        "Сергели": 122,
        "Мирзо Улуғбек": 131,
        "Янгихаёт": 130,
        "Яшнобод": 132,
    },
    "Жиззах": {
        "Миробод": 220,
        "Юнусобод": 225,
        "Чилонзор": 215,
        "Шайхонтохур": 218,
        "Олмазор": 217,
        "Учтепа": 216,
        "Бектемир": 210,
        "Сергели": 212,
        "Мирзо Улуғбек": 221,
        "Янгихаёт": 220,
        "Яшнобод": 222,
    },
    "Қорақалпоғистон": {
        "Миробод": 1100,
        "Юнусобод": 1105,
        "Чилонзор": 1095,
        "Шайхонтохур": 1098,
        "Олмазор": 1097,
        "Учтепа": 1096,
        "Бектемир": 1090,
        "Сергели": 1092,
        "Мирзо Улуғбек": 1101,
        "Янгихаёт": 1100,
        "Яшнобод": 1102,
    }
}

REGIONS_AND_DISTRICTS = {
    "Тошкент ш.": [
        "Миробод", "Олмазор", "Сергели", "Учтепа", "Шайхонтоҳур", "Юнусобод",
        "Яшнобод", "Янгихаёт", "Чилонзор", "Бектемир", "Мирзо Улуғбек"
    ],
    "Тошкент в.": [
        "Тошкент ш.", "Ангрен", "Бекобод", "Бўка", "Чиноз", "Чирчиқ", "Қибрай",
        "Оҳангарон", "Оққўрғон", "Паркент", "Пскент", "Қуйичирчиқ", "Янгийўл", "Юқоричирчиқ", "Зангиота", "Уртачирчиқ"
    ],
    "Наманган": [
        "Наманган ш.", "Косонсой", "Мингбулоқ", "Наманган", "Норин", "Поп", "Тўрақўрғон",
        "Учқўрғон", "Уйчи", "Чуст", "Янгиқўрғон"
    ],
    "Андижон": [
        "Андижон ш.", "Асака", "Балиқчи", "Бўз", "Булоқбоши", "Избоскан", "Жалақудуқ",
        "Хўжаобод", "Қўрғонтепа", "Марҳамат", "Олтинкўл", "Пахтаобод", "Улуғнор", "Шахрихон"
    ],
    "Бухоро": [
        "Бухоро ш.", "Бухоро", "Вобкент", "Ғиждувон", "Жондор", "Когон", "Коракўл",
        "Кораул", "Олот", "Пешкун", "Ромитан", "Шофиркон"
    ],
    "Фарғона": [
        "Фарғона ш.", "Бешариқ", "Бувайда", "Данғара", "Фарғона", "Фурқат", "Қўштепа",
        "Қува", "Қувасой", "Марғилон", "Олтиариқ", "Риштон", "Сўх", "Тошлоқ", "Учкўприк", "Ўзбекистон", "Ёзёвон"
    ],
    "Жиззах": [
        "Жиззах ш.", "Арнасой", "Баҳмал", "Дустлик", "Зарбдор", "Зафаробод", "Зомин",
        "Мирзачўл", "Пахтакор", "Ш.Рашидов", "Янгикент"
    ],
    "Навоий": [
        "Навоий ш.", "Кармана", "Қизилтепа", "Хатирчи", "Конимех", "Нуратa", "Томди", "Учқудуқ", "Зарафшон"
    ],
    "Қашқадарё": [
        "Қарши ш.", "Қарши", "Касби", "Китоб", "Кўнғирот", "Миришкор", "Муборак",
        "Нишон", "Шаҳрисабз", "Чироқчи", "Яккабоғ", "Деҳқонобод", "Ғузор"
    ],
    "Қорақалпоғистон": [
        "Нукус ш.", "Амударё", "Беруний", "Чимбой", "Қанликўл", "Қўнғирот", "Қораўзак",
        "Мўйноқ", "Нукус", "Тахтакўпир", "Тахиотош", "Тўрткўл", "Ҳожайли", "Шуманай", "Элликқалъа"
    ],
    "Самарқанд": [
        "Самарқанд ш.", "Булунғур", "Иштихон", "Жомбой", "Каттақўрғон", "Қўшработ",
        "Нарпай", "Нуробод", "Оқдарё", "Пастдарғом", "Паяриқ", "Пахтачи", "Самарқанд", "Тайлоқ", "Ургут"
    ],
    "Сирдарё": [
        "Гулистон ш.", "Сайхунобод", "Сардоба", "Ширин", "Сирдарё", "Ховос", "Янгиер", "Бойовут", "Гулистон"
    ],
    "Сурхондарё": [
        "Термиз ш.", "Ангор", "Бандихон", "Бойсун", "Денов", "Жарқўрғон", "Қизириқ",
        "Қумқўрғон", "Музработ", "Олтинсой", "Сариосиё", "Шеробод", "Термиз", "Узун"
    ],
    "Хоразм": [
        "Урганч ш.", "Боғот", "Гурлан", "Қўшкўпир", "Шовот", "Урганч", "Хазорасп",
        "Хива", "Янгибозор", "Янгиариқ"
    ]
}

#🔢 Нарх ҳисобловчи функция:
KM_PRICE = 480  # 1 км учун нарх (сўм)

def calculate_price(from_region: str, to_region: str, from_district: str = None, to_district: str = None) -> int:
    if from_region == to_region and from_district == to_district:
        return 0  # агар йўналиш тўлиқ бир хил бўлса
    
    try:
        # 1. Агар туманлар базасидан топилса, туманлар базасидан оламиз
        if from_district and to_district:
            distance = region_to_tashkent_district_distances.get(from_region, {}).get(to_district)
            if distance is None:
                distance = region_to_tashkent_district_distances.get(from_district, {}).get(to_district)
        
        # 2. Агар туманлар базасида топилмаса, вилоятлар базасидан оламиз
        if distance is None:
            distance = uzbekistan_distances.get(from_region, {}).get(to_region)

        # 3. Агар ҳали ҳам топилмаса, хато қайтарилади
        if distance is None:
            return -1  # Агар умуман топилмаса

        raw_price = distance * KM_PRICE
        rounded_price = round(raw_price, -3)  # 1000 сўмлик бутун сонга яқинлаштиради
        #rounded_price = round(raw_price / 5000) * 5000  # 5000 сўмлик бутун сонга яқинлаштиради
        return rounded_price
    #except KeyError:
    except Exception as e:
        print(f"Xatolik: {e}")
        return -1  # агар маълумот топилмаса
